#Задача 4:Напишите программу, которая принимает на вход 2 числа. Задайте список из N элементов, заполненных числами из промежутка [-N, N]. Найдите произведение элементов на указанных позициях (Не индексах). Позиции хранятся в файле file.txt в одной строке одно число.

# Пример:Position one: 1
# Position two: 3   Number of elements:5
#   -> [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]      -> 15

# Чтение чисел из файла
f = open("file.txt", "r")
a, b = f.read().split("\n")
# Перевод строк в числа, в указатели на индексы
a, b = int(a)-1, int(b)-1
N = int(input("Введите количество чисел: "))
# Формирование массива чисел от -N до N
A = []
for i in range(-N, N+1):
    A.append(i)
# Перемножение указанных позиций
res = A[a] * A[b]
# Вывод результатов
print(f"Position one: {a+1}\nPosition two: {b+1}\nNumber of elements: {N}\n{A}\n{res}")